Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Catalog.БиблиотекаПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодовоеНаименование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниClado</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонаЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнструментыТОИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаИзменениеИнициатора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивСсылок") Тогда
		ТекТаблица = ЭтаФорма[Параметры.ТипСсылок];
		Для Каждого Эл Из Параметры.МассивСсылок Цикл                   
			Стр = ТекТаблица.Добавить();
			Стр.Объект = Эл;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеТаблиц()
	
	Если СписокЗадач.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Задачи.Ссылка КАК Объект,
		               |	Задачи.Администратор КАК Администратор,
		               |	Задачи.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Задачи КАК Задачи
					   |ГДЕ Задачи.Ссылка В (&Задачи)";
		Запрос.УстановитьПараметр("Задачи", СписокЗадач.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокЗадач.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если СписокДоговоров.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Договоры.Ссылка КАК Объект,
		               |	Договоры.Администратор КАК Администратор,
		               |	Договоры.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Договоры КАК Договоры
		               |ГДЕ
		               |	Договоры.Ссылка В(&Договоры)";
		Запрос.УстановитьПараметр("Договоры", СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если СписокПроектов.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Проекты.Ссылка КАК Объект,
		               |	Проекты.Администратор КАК Администратор,
		               |	Проекты.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Проекты КАК Проекты
		               |ГДЕ
		               |	Проекты.Ссылка В(&Проекты)";
		Запрос.УстановитьПараметр("Проекты", СписокПроектов.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокПроектов.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиПоДоговорамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Задачи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Задачи КАК Задачи
	               |ГДЕ
	               |	Задачи.Владелец В (&Договоры)";
	Запрос.УстановитьПараметр("Договоры", СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Объект"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = СписокЗадач.Добавить();
		Стр.Объект = Выборка.Ссылка;
	КонецЦикла;
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачиПоДоговорам(Команда)
	СписокЗадач.Очистить();
	ЗаполнитьЗадачиПоДоговорамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорыПоПроектамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |ГДЕ
	               |	Договоры.Проект В (&Проекты)";
	Запрос.УстановитьПараметр("Проекты", СписокПроектов.Выгрузить().ВыгрузитьКолонку("Объект"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = СписокДоговоров.Добавить();
		Стр.Объект = Выборка.Ссылка;
	КонецЦикла;
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорыПоПроектам(Команда)
	СписокДоговоров.Очистить();
	ЗаполнитьДоговорыПоПроектамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыНаСервере()
	Для Каждого Стр ИЗ СписокПроектов Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
	Для Каждого Стр ИЗ СписокДоговоров Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
	Для Каждого Стр ИЗ СписокЗадач Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура мИзменитьРеквизиты(Команда)
	ИзменитьРеквизитыНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизиты изменены.");
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыОбъекта(СсылкаНаОбъект)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, "Инициатор, Администратор");
КонецФункции

&НаКлиенте
Процедура СписокОбъектовОбъектПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровОбъектПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры
